{
  "action": "balance",
  "actionName": "Balance",
  "skill": "acrobatics",
  "traits": ["move"],
  "description": "You move across a narrow surface or uneven ground, attempting an Acrobatics check",

  "variants": {
    "default": {
      "displayName": "Balance",
      "narratives": {
        "minimal": {
          "criticalSuccess": [
            "You balance perfectly!",
            "You walk across easily!",
            "You glide across smoothly!",
            "You cross with perfect poise!",
            "You balance expertly!"
          ],
          "success": [
            "You balance successfully.",
            "You make it across.",
            "You keep your footing.",
            "You cross carefully.",
            "You balance adequately."
          ],
          "failure": [
            "You wobble dangerously.",
            "You can't keep balanced.",
            "You lose your footing.",
            "You slip.",
            "You can't stay balanced."
          ],
          "criticalFailure": [
            "You fall off!",
            "You lose your balance completely!",
            "You plunge down!",
            "You slip and fall!",
            "You tumble off!"
          ]
        },

        "standard": {
          "criticalSuccess": [
            "You walk across the narrow surface with perfect balance and confidence!",
            "You glide across smoothly, barely seeming to notice the precarious footing!",
            "Your balance is impeccable - you cross with poise and grace!",
            "You navigate the narrow path with the confidence of a tightrope walker!",
            "You maintain perfect balance, crossing easily!",
            "You walk across like it's a wide path - your balance is flawless!",
            "You move across with such grace you make it look trivial!",
            "Your balance is superb - you cross without hesitation!",
            "You glide across the narrow surface effortlessly!",
            "You maintain perfect equilibrium across the precarious path!"
          ],
          "success": [
            "You carefully balance your way across the narrow surface.",
            "You manage to keep your balance, crossing successfully.",
            "You make it across, arms outstretched for stability.",
            "You successfully navigate the narrow path.",
            "You maintain adequate balance to cross.",
            "You carefully walk across, staying balanced.",
            "You make it across without falling.",
            "You successfully keep your footing.",
            "You cross the narrow surface safely.",
            "You balance well enough to make it across."
          ],
          "failure": [
            "You wobble dangerously, arms windmilling as you struggle to stay up!",
            "You can't maintain your balance - you're forced to stop!",
            "You lose your footing and have to catch yourself!",
            "You sway dangerously, unable to proceed safely!",
            "Your balance fails - you can't continue!",
            "You teeter precariously, unable to move forward!",
            "You struggle to stay upright on the narrow surface!",
            "Your footing falters - you can't keep balanced!",
            "You wobble badly, unable to cross!",
            "You lose your balance and must stop!"
          ],
          "criticalFailure": [
            "You lose your balance completely and fall!",
            "You slip off the narrow surface and plunge down!",
            "Your footing fails catastrophically - you're falling!",
            "You tumble off the narrow path!",
            "You lose your balance entirely and fall off!",
            "You slip and fall from the precarious surface!",
            "Your balance fails completely - you're dropping!",
            "You fall off, unable to catch yourself!",
            "You plummet off the narrow surface!",
            "You tumble off in a failed balancing attempt!"
          ]
        },

        "detailed": {
          "criticalSuccess": [
            "You step onto the narrow surface with complete confidence, and your poise is justified. Your balance is perfect, each foot finding exactly the right placement. You walk across as if it were a wide boulevard, your equilibrium never wavering. Your crossed arms and relaxed posture make it clear this is well within your abilities!",
            "With the grace of an acrobat, you glide across the narrow surface. Your center of gravity stays perfectly aligned over your feet, and you adjust to tiny variations in the surface without conscious thought. You make the difficult crossing look easy!",
            "You navigate the precarious path with masterful balance. Every muscle makes tiny adjustments to keep you perfectly stable, and you cross with the confidence of someone who's done this a thousand times. Excellent form!"
          ],
          "success": [
            "You carefully place each foot, testing your balance with every step. Your arms stretch out for stability, and you move slowly but surely across the narrow surface. It's not graceful, but it works - you make it across safely.",
            "You maintain your balance through concentration and careful movement. Each step is deliberate as you work your way across the precarious surface. You succeed, though it takes effort.",
            "You manage to keep your footing as you cross the narrow path. Your balance isn't perfect, and you wobble a few times, but you make it across without falling."
          ],
          "failure": [
            "You step onto the narrow surface and immediately feel your balance failing. Your arms windmill desperately as you sway back and forth, but you can't find stable footing. You're forced to retreat or stop, unable to proceed safely.",
            "Try as you might, you simply can't maintain your balance well enough to cross. You wobble dangerously, and common sense forces you to abandon the attempt before you fall.",
            "Your balance proves inadequate for this challenge. You teeter on the narrow surface, arms flailing, but you can't stabilize enough to move forward."
          ],
          "criticalFailure": [
            "You step confidently onto the narrow surface, but your balance immediately betrays you. Your foot slips, your center of gravity shifts wrong, and suddenly you're not balanced anymore - you're falling! You drop from the precarious perch, unable to catch yourself!",
            "Your attempt to cross goes catastrophically wrong. One moment you're trying to balance, the next your footing fails completely. You tumble off the narrow surface, arms grasping futilely at air as you fall!",
            "Your balance fails in the worst possible way. Without warning, your footing gives out and you plunge off the narrow surface, the sickening sensation of freefall gripping you!"
          ]
        },

        "cinematic": {
          "criticalSuccess": [
            "You step onto the narrow surface with the casual confidence of a tightrope walker. Your body becomes a perfect instrument of balance - every muscle, every subtle shift of weight working in flawless harmony to maintain equilibrium. You don't walk across the precarious path so much as flow across it. Your footfalls are precise, your posture relaxed yet controlled. To watch you is to see the art of balance perfected. You cross the narrow surface as if it were a wide road, making the difficult look effortless!",
            "Like a cat walking a fence, you navigate the narrow surface with supreme grace and confidence. Your balance is intuitive and perfect. You barely glance down, trusting your body's innate sense of equilibrium. Your crossed arms and easy pace make it abundantly clear that this challenge is well within your considerable abilities. You glide across with such poise that spectators might forget how difficult this actually is!"
          ],
          "success": [
            "You manage the crossing through careful attention and deliberate movement. Arms extended for balance, you inch your way across the narrow surface. It's not elegant, but it's effective. You maintain your footing and complete the crossing successfully.",
            "Through concentration and cautious footwork, you keep your balance well enough to cross. You wobble a few times, requiring quick corrections, but you make it across safely."
          ],
          "failure": [
            "Despite your best efforts and careful technique, you simply cannot maintain adequate balance. You step onto the narrow surface, arms extending for stability, but you immediately begin to wobble. Your corrections overcorrect, your attempts to stabilize only making things worse. You're forced to retreat before you fall.",
            "Your balance proves unequal to this particular challenge. You try - arms out, weight shifting carefully - but you can't find stable equilibrium. The wobbling becomes too severe, and you must abandon the attempt."
          ],
          "criticalFailure": [
            "Everything goes wrong in an instant. You step onto the narrow surface with reasonable confidence, but that confidence is immediately betrayed by reality. Maybe the surface is more unstable than you thought, maybe your weight distribution is off, maybe simple bad luck intervenes - but the result is undeniable. Your balance fails catastrophically. You feel the sickening shift as your center of gravity moves beyond recovery. Your arms windmill desperately, your body contorts trying to compensate, but physics is unforgiving. You fall, dropping from the narrow surface, the ground rushing up toward you with terrifying speed!",
            "Your attempted crossing becomes a plummet. One moment you're trying to balance, focused and careful. The next moment everything falls apart - literally. Your footing fails, your balance evaporates, and suddenly you're not on the narrow surface anymore. You're in the air, falling, with that horrible dropping sensation in your stomach. The narrow path above you gets farther away as you plunge down, your failed balancing act ending in disaster!"
          ]
        }
      }
    },

    "steady-balance": {
      "displayName": "Balance (Steady Balance)",
      "feats": ["steady-balance"],
      "narratives": {
        "minimal": {
          "criticalSuccess": [
            "You race across at full speed!",
            "You sprint across perfectly!",
            "You run across without slowing!",
            "You dash across with perfect balance!",
            "You cross at top speed!"
          ],
          "success": [
            "You balance at full speed.",
            "You cross quickly.",
            "You move fast without slowing.",
            "You maintain speed and balance.",
            "You cross rapidly."
          ],
          "failure": [
            "Speed breaks your balance.",
            "You can't maintain both.",
            "Too fast - you wobble.",
            "You must slow down.",
            "Speed defeats you."
          ],
          "criticalFailure": [
            "Your speed causes you to fall!",
            "You rush and slip off!",
            "Too fast - you lose control!",
            "Your pace costs you!",
            "Speed makes you fall!"
          ]
        },

        "standard": {
          "criticalSuccess": [
            "You race across the narrow surface at full speed with perfect balance!",
            "You sprint across without slowing, maintaining flawless equilibrium!",
            "You dash across at top speed, your balance never wavering!",
            "You cross at full pace with the confidence of a master acrobat!",
            "You run across the precarious surface like it's solid ground!",
            "Your steady balance lets you move at full speed without hesitation!",
            "You race forward, speed and balance perfectly combined!",
            "You sprint across with such poise you make it look easy!",
            "You cross at maximum speed with perfect stability!",
            "You dash across rapidly, your balance impeccable!"
          ],
          "success": [
            "You successfully balance while moving at full speed across.",
            "You cross rapidly, maintaining adequate balance despite your pace.",
            "You manage to move quickly without losing your footing.",
            "You balance at full speed successfully.",
            "You cross at normal pace instead of half, staying balanced.",
            "You move swiftly across while maintaining your equilibrium.",
            "You successfully combine speed with balance.",
            "You cross quickly without falling.",
            "You maintain balance at full speed successfully.",
            "You move rapidly while staying on the narrow surface."
          ],
          "failure": [
            "You try to move at full speed but your balance can't keep up!",
            "Your rapid pace breaks your balance - you wobble dangerously!",
            "You can't maintain both speed and stability!",
            "Moving too fast costs you your balance!",
            "Your steady balance fails - you must slow down or stop!",
            "Speed defeats your equilibrium - you can't proceed!",
            "You wobble badly when trying to move quickly!",
            "Your rapid movement breaks your balance!",
            "You can't cross that fast - you lose your footing!",
            "Speed and balance prove incompatible!"
          ],
          "criticalFailure": [
            "Your speed sends you careening off balance - you fall!",
            "Moving too fast destroys your equilibrium - you plunge off!",
            "Your rapid pace causes catastrophic balance failure!",
            "You rush across and slip off the narrow surface!",
            "Speed breaks your balance completely - you're falling!",
            "Your fast movement sends you tumbling off!",
            "You lose control at high speed and fall!",
            "Your rapid crossing ends in a fall!",
            "Speed costs you everything - you plummet off!",
            "Your steady balance fails catastrophically at speed!"
          ]
        },

        "detailed": {
          "criticalSuccess": [
            "You demonstrate the remarkable ability to maintain perfect balance while moving at full speed. Most people have to creep across narrow surfaces, but you've trained to move quickly. You race across the precarious path with complete confidence, your body making constant micro-adjustments to keep you stable even at speed. Your steady balance makes the difficult crossing look trivial!",
            "With expert technique, you combine speed with stability. You don't slow down for the narrow surface - you trust your trained balance to handle the pace. You dash across rapidly, your equilibrium perfect despite the velocity. It's an impressive display of acrobatic skill!",
            "Your steady balance training shines. You move across the narrow surface at full speed, never hesitating, never wobbling. Your body has learned to maintain equilibrium even while moving quickly. You cross rapidly and safely!"
          ],
          "success": [
            "You employ steady balance techniques to cross at full speed. It's more demanding than moving slowly - your balance has to react much faster to maintain stability. But you manage it successfully, crossing at normal pace instead of the usual cautious creep.",
            "You move across at full speed while maintaining adequate balance. It takes significant skill to combine velocity with stability, but your training carries you through. You cross quickly without falling.",
            "Your steady balance works. You don't have to slow to half speed like normal - you cross at full pace while keeping your footing through practiced technique."
          ],
          "failure": [
            "You attempt to cross at full speed, but the combination of pace and balance proves too difficult. Moving quickly on such a narrow surface creates instability your balance can't compensate for. You wobble dangerously and are forced to slow down or stop.",
            "Despite your steady balance training, you can't maintain equilibrium at full speed on this surface. Your rapid movement breaks your balance. You must slow to a safer pace or abandon the attempt.",
            "Speed and balance prove incompatible on this narrow surface. You try to move at full pace, but your balance can't keep up. You wobble badly and have to slow down."
          ],
          "criticalFailure": [
            "You try to cross at full speed with confidence in your steady balance, but it backfires catastrophically. Moving quickly on the narrow surface proves too much. Your balance fails at speed, and momentum works against you. You can't recover - you're falling off the narrow surface!",
            "Your attempt to combine speed with balance goes disastrously wrong. You're moving too fast when your footing slips. Unlike a slow, careful crossing where you might catch yourself, at this speed there's no time to recover. You plunge off the narrow surface!",
            "Speed destroys your balance completely. You rush across confidently, but the rapid pace proves your undoing. Your balance fails, and at full speed, the failure is catastrophic. You tumble off, unable to catch yourself!"
          ]
        },

        "cinematic": {
          "criticalSuccess": [
            "This is steady balance mastered. Most people creep across narrow surfaces, inching forward with arms outstretched, every step a deliberate test of equilibrium. Not you. You've trained your body to maintain perfect balance even at speed. You approach the narrow surface and simply run across it. Your feet move with rapid precision, placing themselves perfectly even at full pace. Your body makes constant micro-adjustments - a slight shift here, a lean there - maintaining equilibrium through speed rather than despite it. You race across the precarious path like it's a wide road, your steady balance making the impossible look routine. It's breathtaking to watch!",
            "Like a parkour athlete, you demonstrate that balance and speed aren't opposites - they're complementary skills. You sprint across the narrow surface with absolute confidence, your trained equilibrium handling the challenge effortlessly. Your footfalls are rapid but precise, your balance perfect despite the velocity. You cover the distance in seconds, making the difficult crossing look trivial through superior technique. This is steady balance perfected!"
          ],
          "success": [
            "You successfully employ steady balance techniques to cross at full speed. It's demanding work - balance is much harder when you're moving quickly. But your training carries you through. You cross rapidly without falling, combining speed with adequate stability.",
            "You balance at full pace successfully. Most people would slow to a careful creep, but you trust your trained equilibrium. You move across quickly, maintaining enough balance to complete the crossing safely."
          ],
          "failure": [
            "You attempt to cross at full speed with confidence, but the narrow surface proves more challenging than expected. Moving quickly destabilizes you - your rapid footfalls can't find reliable purchase. Your balance begins to fail, wobbling becoming dangerous. You're forced to slow to a safer pace or abandon the attempt entirely.",
            "Despite your steady balance training, speed and stability prove incompatible on this particular surface. You try to move at full pace, but your balance can't keep up with the demands. Wobbling becomes severe, forcing you to slow down or stop."
          ],
          "criticalFailure": [
            "You launch across the narrow surface at full speed, confident in your steady balance training. For a few steps it works beautifully - you're racing across with perfect poise. Then physics and probability catch up with you. At this velocity, even a tiny misstep becomes catastrophic. Your foot placement is off by mere centimeters, but at full speed that's enough. Your balance fails in an instant. Momentum carries you forward even as equilibrium disappears. Your arms windmill desperately, your body contorts trying to compensate, but it's futile. You're moving too fast to recover. You tumble off the narrow surface, your steady balance training transformed into dangerous overconfidence. The fall is unavoidable and terrifying!",
            "Speed and balance form a perfect partnership when executed correctly. But when they fail, the failure is spectacular. You're racing across the narrow surface, trusting your trained equilibrium to handle the pace. Then something goes wrong - a slip, a wobble, an unexpected variation in the surface. At a slow, careful pace, you might recover. But you're moving at full speed. There's no time to correct, no opportunity to catch yourself. Your balance fails catastrophically. Momentum works against you. You careen off the narrow surface, falling, your attempt at steady balance becoming a lesson in the dangers of excessive speed!"
          ]
        }
      }
    }
  }
}
