{
  "action": "feint",
  "actionName": "Feint",
  "skill": "deception",
  "traits": ["mental"],
  "description": "You attempt to trick your opponent with misleading movements, feints, and false attacks",

  "variants": {
    "default": {
      "displayName": "Feint",
      "narratives": {
        "minimal": {
          "criticalSuccess": [
            "You deceive {targetName} completely!",
            "Perfect feint!",
            "You utterly mislead them!",
            "{targetName} falls for it entirely!",
            "Brilliant deception!"
          ],
          "success": [
            "You feint successfully.",
            "{targetName} is fooled.",
            "Your deception works.",
            "They fall for your trick.",
            "You mislead them."
          ],
          "failure": [
            "{targetName} sees through it.",
            "Your feint fails.",
            "They aren't fooled.",
            "{targetName} reads you.",
            "Your deception doesn't work."
          ],
          "criticalFailure": [
            "You telegraph your real intent!",
            "{targetName} sees through you completely!",
            "Your feint backfires!",
            "They read you perfectly!",
            "You give yourself away!"
          ]
        },

        "standard": {
          "criticalSuccess": [
            "Your feint is masterful - {targetName} completely falls for your deception!",
            "You perfectly mislead {targetName} with your false movements!",
            "{targetName} is utterly deceived by your brilliant feint!",
            "Your deceptive movements completely fool {targetName}!",
            "You trick {targetName} with a perfectly executed feint!",
            "{targetName} falls completely for your deceptive attack!",
            "Your misleading movements utterly fool {targetName}!",
            "You perfectly deceive {targetName} with your feint!",
            "{targetName} is thoroughly misled by your deception!",
            "Your feint works perfectly - {targetName} is completely fooled!"
          ],
          "success": [
            "You successfully feint, misleading {targetName} momentarily.",
            "Your deceptive movements fool {targetName}.",
            "{targetName} falls for your feint.",
            "You trick {targetName} with your false attack.",
            "Your misleading movements work - {targetName} is deceived.",
            "You successfully deceive {targetName} with your feint.",
            "{targetName} is fooled by your deceptive movements.",
            "Your feint works - {targetName} doesn't see your real intent.",
            "You mislead {targetName} successfully.",
            "{targetName} falls for your trick."
          ],
          "failure": [
            "{targetName} sees through your feint.",
            "Your deceptive movements don't fool {targetName}.",
            "{targetName} reads your true intentions.",
            "Your feint fails to mislead {targetName}.",
            "{targetName} isn't deceived by your false attack.",
            "Your attempt to feint is unsuccessful.",
            "{targetName} sees right through your deception.",
            "Your misleading movements fail to trick {targetName}.",
            "{targetName} anticipates your real move.",
            "Your feint doesn't work on {targetName}."
          ],
          "criticalFailure": [
            "Your feint completely backfires - {targetName} reads you perfectly!",
            "{targetName} sees through your deception and predicts your real attack!",
            "Your obvious feint telegraphs your true intentions to {targetName}!",
            "{targetName} reads you like a book - your deception fails utterly!",
            "Your failed feint actually reveals your strategy to {targetName}!",
            "{targetName} anticipates your feint and your real move!",
            "Your clumsy deception is obvious to {targetName}!",
            "{targetName} sees right through you and prepares for your real attack!",
            "Your feint is so obvious it helps {targetName} defend!",
            "{targetName} reads your intentions perfectly - your feint backfires!"
          ]
        },

        "detailed": {
          "criticalSuccess": [
            "You execute a masterful feint, your body language and movements creating a perfect illusion of an impending attack from one angle while you prepare to strike from another. {targetName} falls for it completely, shifting their guard to defend against the false threat. Their defenses are wide open!",
            "Your deceptive movements are a work of art. You fake an attack with such conviction that {targetName} commits fully to defending against it. When they realize it was a feint, it's too late - they're completely out of position and vulnerable!",
            "You sell the false attack perfectly. Every movement, every shift of weight suggests an incoming strike. {targetName} reads the fake signals and reacts accordingly, leaving themselves thoroughly exposed when they realize you deceived them!"
          ],
          "success": [
            "You make a convincing false attack, and {targetName} takes the bait. They shift their defenses to counter the feint, creating a brief opening you can exploit.",
            "Your deceptive movements work. {targetName} falls for the feint and momentarily focuses on the wrong threat, giving you an advantage.",
            "You successfully mislead {targetName} with your false attack. They're fooled enough to create an opening in their defenses."
          ],
          "failure": [
            "You attempt the feint, but {targetName} isn't fooled. They maintain their defensive stance, having seen through your deception.",
            "Your false attack doesn't deceive {targetName}. They keep their guard up, unaffected by your attempt to mislead them.",
            "{targetName} reads your body language correctly and doesn't fall for the feint. Your deception fails to create an opening."
          ],
          "criticalFailure": [
            "Your feint is clumsy and obvious. Not only does {targetName} see through it immediately, but your telegraphed movements actually reveal your real intentions. They read you perfectly and are now better prepared to defend against your actual attack!",
            "Your attempt to deceive backfires spectacularly. {targetName} not only sees through the feint but uses your obvious deception to predict your true strategy. Your failed trick has actually given them an advantage!",
            "You try to feint but your movements are too obvious. {targetName} reads the deception instantly and uses the information to better position their defenses. Your failed feint has made your job harder!"
          ]
        },

        "cinematic": {
          "criticalSuccess": [
            "You become a dancer of deception, every movement calculated to mislead. Your eyes flick to one target area while your weight shifts subtly toward another. Your weapon begins a strike that looks utterly committed - the angle perfect, the timing right, the force building. {targetName} reads all these signals and reacts exactly as you intended, committing to defend against an attack that will never come. By the time they realize they've been deceived, their guard is in shambles and they're wide open. It's a masterpiece of misdirection - the perfect feint!",
            "Like a stage magician directing attention away from the trick, you orchestrate a symphony of false tells. Your shoulders telegraph one direction, your eyes another, your weapon suggests a third. The conflicting signals resolve into one clear - and completely false - threat. {targetName} falls for it utterly, their experienced combat instincts turned against them as they defend against the phantom attack. When reality reasserts itself and they realize the deception, they're thoroughly out of position. You've weaponized their own skill against them!"
          ],
          "success": [
            "You execute a solid feint, selling the false attack with enough conviction to mislead {targetName}. They bite on the deception and shift their defenses accordingly. It's not a complete devastation of their guard, but it creates a tangible opening.",
            "Your deceptive movements work their magic. {targetName} reads the false signals you're broadcasting and reacts to defend against the feint. For a critical moment, their attention is focused on the wrong threat, creating an exploitable weakness in their defense."
          ],
          "failure": [
            "You attempt the deception, broadcasting false signals about your intended attack, but {targetName} isn't buying what you're selling. Maybe they're too experienced, maybe your technique isn't quite polished enough, or maybe they're just having a moment of exceptional awareness. Whatever the reason, they don't fall for it. Their guard remains solid, unaffected by your attempted misdirection.",
            "Your feint fails to deceive. {targetName} maintains their defensive focus, either seeing through your false movements or simply refusing to commit to defending against uncertain threats. Your deceptive attack generates no advantage."
          ],
          "criticalFailure": [
            "Your attempted feint goes catastrophically wrong. Maybe you're too obvious, maybe your timing is off, or maybe {targetName} is just that good at reading opponents - but not only do they see through the deception instantly, they actually use your failed feint against you. Your obvious false attack telegraphs your real intentions like a neon sign. They read your true strategy from your clumsy deception and adjust their defenses accordingly. What should have created an opening instead strengthens their guard. Your feint has backfired completely!",
            "Disaster strikes your deception. You commit to the feint, broadcasting false signals about an incoming attack, but every movement screams 'fake' to {targetName}. Not only do they not fall for it, but your obvious deception actually reveals your real plan. It's like showing them your playbook. They see through the feint, predict your actual attack, and position themselves perfectly to defend against it. Your failed deception has actively helped your opponent - the worst possible outcome!"
          ]
        }
      }
    }
  }
}
