{
  "action": "hide",
  "actionName": "Hide",
  "skill": "stealth",
  "traits": ["secret"],
  "description": "You attempt to become hidden from creatures that could detect you",

  "variants": {
    "default": {
      "displayName": "Hide",
      "narratives": {
        "minimal": {
          "criticalSuccess": [
            "You vanish from sight!",
            "You're completely hidden!",
            "Perfect concealment!",
            "You disappear!",
            "You blend into the shadows!"
          ],
          "success": [
            "You hide successfully.",
            "You're now hidden.",
            "You conceal yourself.",
            "You slip out of sight.",
            "You become hidden."
          ],
          "failure": [
            "You remain visible.",
            "You can't hide effectively.",
            "You stay exposed.",
            "Your hiding fails.",
            "You're still seen."
          ],
          "criticalFailure": [
            "You give away your position!",
            "You draw attention!",
            "Your hiding attempt is obvious!",
            "You make noise!",
            "You reveal yourself!"
          ]
        },

        "standard": {
          "criticalSuccess": [
            "You vanish completely - you're perfectly hidden and undetected!",
            "You find ideal concealment and disappear from view entirely!",
            "You blend into your surroundings so well you're virtually invisible!",
            "You conceal yourself expertly - no one can see you!",
            "You slip into the shadows and become completely hidden!",
            "You find perfect cover and disappear from sight!",
            "You hide so effectively you're completely undetectable!",
            "You melt into your surroundings with expert precision!",
            "You conceal yourself flawlessly - you're invisible to observers!",
            "You find ideal concealment and vanish from view!"
          ],
          "success": [
            "You successfully hide from view.",
            "You find adequate cover and conceal yourself.",
            "You slip out of sight successfully.",
            "You hide effectively behind available cover.",
            "You manage to conceal yourself adequately.",
            "You successfully become hidden.",
            "You find concealment and hide from observers.",
            "You slip into cover successfully.",
            "You hide well enough to avoid detection.",
            "You conceal yourself behind available cover."
          ],
          "failure": [
            "You can't find adequate concealment to hide.",
            "Your attempt to hide fails - you remain visible.",
            "You're unable to conceal yourself effectively.",
            "You stay exposed despite your efforts to hide.",
            "You can't find sufficient cover to hide.",
            "Your hiding attempt is unsuccessful.",
            "You remain in view despite trying to hide.",
            "You're unable to slip out of sight.",
            "You can't conceal yourself adequately.",
            "Your attempt to hide doesn't work."
          ],
          "criticalFailure": [
            "Your clumsy hiding attempt actually draws attention to your position!",
            "You knock something over trying to hide - everyone notices!",
            "Your obvious attempt to conceal yourself makes you more noticeable!",
            "You make noise while trying to hide and give away your location!",
            "Your failed hiding attempt reveals exactly where you are!",
            "You stumble while trying to hide and draw all eyes to you!",
            "Your obvious movements while hiding make you more visible!",
            "You accidentally alert everyone to your exact position!",
            "Your clumsy concealment attempt highlights your location!",
            "You make yourself MORE obvious trying to hide!"
          ]
        },

        "detailed": {
          "criticalSuccess": [
            "You find the perfect spot and use it with expert skill. Whether it's shadows, physical cover, or environmental concealment, you exploit it masterfully. You control your breathing, minimize movement, and position yourself ideally. Within moments, you've vanished from view completely. Anyone looking for you would have no idea where you are!",
            "Your concealment technique is flawless. You blend into your surroundings with practiced ease, using every available advantage - light, shadow, cover, camouflage. You become part of the environment, invisible to casual and even careful observation. You're completely hidden!",
            "You slip into concealment with the skill of a professional. Your movements are silent, your positioning perfect, your use of available cover expert. You disappear so completely that you might as well be invisible!"
          ],
          "success": [
            "You find adequate cover and conceal yourself behind it. You're not invisible, but you're successfully hidden from view. As long as you stay still and quiet, you should remain undetected.",
            "You successfully hide yourself from observers. You position yourself behind available concealment and minimize your profile. You're hidden, though not perfectly - but it should be enough.",
            "You manage to conceal yourself adequately. Using available cover, you slip out of direct sight. You're now hidden from view."
          ],
          "failure": [
            "You try to hide, but there simply isn't adequate concealment available, or you can't position yourself well enough to use it. Despite your best efforts, you remain visible to observers.",
            "Your attempt to hide doesn't work. Maybe the cover isn't sufficient, maybe your positioning is wrong, or maybe you're just in too exposed a location. Whatever the reason, you can't successfully conceal yourself.",
            "You can't find a way to hide effectively. The available concealment is inadequate or your technique is insufficient. You remain exposed and visible."
          ],
          "criticalFailure": [
            "Your attempt to hide goes catastrophically wrong. Maybe you knock something over, maybe you step on something that makes noise, or maybe your movements are just too obvious. Whatever the cause, instead of concealing yourself, you've actually drawn attention to your exact location. Everyone knows exactly where you are!",
            "Disaster strikes your hiding attempt. In your hurry or nervousness to conceal yourself, you make a critical error - a loud noise, an obvious movement, something that completely defeats the purpose. Not only have you failed to hide, but you've actively revealed your position to anyone who might be looking!",
            "Your clumsy hiding attempt backfires completely. Instead of slipping quietly into concealment, you make yourself the center of attention. Your obvious movements, noise, or poor positioning have actually made you more noticeable than if you'd just stood still!"
          ]
        },

        "cinematic": {
          "criticalSuccess": [
            "You move with the fluid grace of a shadow dancer, reading the environment with perfect understanding. There - that patch of darkness between the crates. You slip into it with practiced ease, your movements controlled and silent. Your body settles into perfect stillness, breathing shallow and quiet. You become part of the shadows themselves, indistinguishable from the environment around you. To any observer, you've simply vanished. You've achieved perfect concealment - the kind of hiding that borders on invisibility!",
            "Like smoke dissipating in a breeze, you seem to fade from view. You understand concealment instinctively, reading the play of light and shadow, the gaps in vision, the blind spots in attention. You flow into the perfect position and become absolutely still. Your silhouette blends with your surroundings, your minimal movements masked by environmental motion. Within seconds, you've transformed from visible presence to invisible watcher. Anyone looking for you would swear you'd vanished into thin air!"
          ],
          "success": [
            "You find workable cover and slip behind it. Your movements are controlled, your positioning adequate. You're not perfectly invisible, but you're successfully hidden from casual observation. As long as you remain still and quiet, you should stay undetected.",
            "You successfully conceal yourself using available cover. It's not the most perfect hiding spot ever used, but it works. You're out of direct sight, hidden well enough to avoid detection unless someone specifically searches for you."
          ],
          "failure": [
            "You search for concealment but come up empty. The available cover is inadequate, the shadows too thin, the concealment insufficient. Despite your best efforts to position yourself optimally, you remain visible. You simply can't hide effectively in this situation.",
            "Your hiding attempt fails to achieve concealment. Whether it's poor cover, bad positioning, or just unfortunate circumstances, you can't slip out of sight. You remain exposed and visible despite your efforts."
          ],
          "criticalFailure": [
            "Everything goes wrong at once. You're moving toward concealment when your foot catches on something - maybe debris, maybe uneven ground. The sound is loud in the relative quiet. You stumble, arms windmilling for balance, and knock into your intended hiding place. The noise is unmistakable, the motion obvious. Instead of disappearing from view, you've just announced your exact position to everyone in earshot. Your hiding attempt hasn't just failed - it's backfired spectacularly, making you far more noticeable than if you'd just stood in plain sight!",
            "Your attempt to hide becomes a disaster. Maybe you misjudge the concealment, maybe you move too quickly, or maybe you're just having the worst luck imaginable, but instead of slipping quietly out of sight, you create a spectacle. Noise, obvious movement, disturbed environment - you might as well have set off a flare announcing your location. Not only have you failed to hide, but you've actively drawn attention to yourself. Every eye in the area knows exactly where you are!"
          ]
        }
      }
    },

    "terrain-stalker": {
      "displayName": "Hide (Terrain Stalker)",
      "feats": ["terrain-stalker"],
      "narratives": {
        "minimal": {
          "criticalSuccess": [
            "You vanish into the terrain!",
            "Nature perfectly conceals you!",
            "You become one with the environment!",
            "The terrain hides you completely!",
            "You blend into nature perfectly!"
          ],
          "success": [
            "The terrain conceals you.",
            "Natural cover hides you.",
            "You blend with nature.",
            "The environment conceals you.",
            "Nature hides you."
          ],
          "failure": [
            "The terrain can't hide you.",
            "Nature provides no concealment.",
            "You can't blend with terrain.",
            "The environment is too open.",
            "Natural cover fails."
          ],
          "criticalFailure": [
            "You disturb the terrain!",
            "You make the environment obvious!",
            "You alert observers!",
            "Your movement betrays you!",
            "Nature reveals you!"
          ]
        },

        "standard": {
          "criticalSuccess": [
            "You vanish into the natural terrain - completely hidden by the environment!",
            "You blend perfectly with nature itself - you're invisible!",
            "The terrain conceals you masterfully - no one can see you!",
            "You become one with the natural environment - perfectly hidden!",
            "Nature itself hides you completely - you've vanished!",
            "You use the terrain expertly - you're completely concealed!",
            "You blend into nature so well you're virtually invisible!",
            "The natural environment conceals you perfectly!",
            "You melt into the terrain with expert precision!",
            "Nature provides perfect concealment - you've disappeared!"
          ],
          "success": [
            "You successfully hide using the natural terrain.",
            "The environment provides adequate concealment.",
            "You blend with nature well enough to hide.",
            "Natural terrain conceals you from view.",
            "You use the environment to hide successfully.",
            "The terrain provides enough cover to conceal yourself.",
            "You blend into the natural surroundings.",
            "Nature conceals you adequately.",
            "You hide using terrain features successfully.",
            "The environment hides you from observers."
          ],
          "failure": [
            "The natural terrain can't hide you effectively.",
            "The environment is too exposed to conceal you.",
            "You can't blend with the terrain well enough.",
            "Natural features provide insufficient concealment.",
            "The terrain fails to hide you.",
            "You remain visible despite the environment.",
            "Nature can't conceal you here.",
            "The terrain is too open to hide.",
            "You can't use the environment to hide.",
            "Natural cover is inadequate."
          ],
          "criticalFailure": [
            "You disturb the natural terrain and draw attention to yourself!",
            "Your clumsy movement through nature alerts everyone to your position!",
            "You rustle vegetation loudly - everyone knows where you are!",
            "You disrupt the environment and reveal your exact location!",
            "Your failed attempt to use terrain makes you very obvious!",
            "You disturb natural features and draw all eyes to you!",
            "You make noise in the environment and give away your position!",
            "Your movement through terrain actually highlights your location!",
            "You crash through nature and alert everyone!",
            "Your clumsy use of terrain makes you MORE visible!"
          ]
        },

        "detailed": {
          "criticalSuccess": [
            "You demonstrate masterful understanding of natural concealment. In terrain others would find too exposed, you spot countless hiding opportunities - a depression in the ground, natural vegetation patterns, rock formations, terrain contours. You position yourself perfectly within the natural environment, using its features to break up your silhouette and blend with the surroundings. You become part of nature itself, completely hidden without needing artificial cover!",
            "Your terrain stalker training shines. Where others see open ground, you see concealment opportunities everywhere. You use the subtle variations in the landscape - grass patterns, shadows cast by rocks, natural depressions, vegetation clusters. You blend with the terrain so perfectly that you're invisible to observers. Nature itself conceals you completely!",
            "You read the natural terrain with expert eyes and exploit it masterfully. The environment provides perfect concealment when you know how to use it. You position yourself ideally within nature's features and vanish from view completely!"
          ],
          "success": [
            "You successfully use natural terrain features to hide. Where others might need artificial cover, you find concealment in the environment itself - vegetation, rocks, terrain contours, natural shadows. You blend with nature adequately and conceal yourself from view.",
            "Your terrain stalker skills let you hide using the natural environment. You position yourself within terrain features and use them to conceal yourself successfully, despite the lack of traditional cover.",
            "You manage to hide using only natural terrain. Your understanding of environmental concealment lets you blend with nature well enough to remain hidden from observers."
          ],
          "failure": [
            "Despite your terrain stalker training, you can't find adequate concealment in this natural environment. The terrain is too flat, too exposed, or too barren. Even with your skills, you can't hide effectively here.",
            "You search for natural concealment opportunities but find none sufficient. The environment simply doesn't provide the terrain features you need to hide, even with your advanced techniques.",
            "Your terrain stalker abilities fail in this environment. The natural terrain is too open or featureless to provide concealment, leaving you exposed despite your expertise."
          ],
          "criticalFailure": [
            "Your attempt to hide in the natural terrain backfires catastrophically. Maybe you rustle dry leaves, maybe you disturb tall grass, or maybe you dislodge a rock - but the result is clear. Instead of concealing yourself in nature, you've announced your exact position. Every observer knows precisely where you are in the terrain!",
            "Disaster strikes your natural concealment attempt. Your movement through the environment creates obvious disturbance - swaying vegetation, displaced earth, scattered wildlife. Far from hiding you, the terrain now advertises your exact location to everyone!",
            "Your terrain stalker attempt fails spectacularly. Instead of blending with nature, you've disrupted it in ways that highlight your presence. Your position in the natural terrain is now very obvious to all observers!"
          ]
        },

        "cinematic": {
          "criticalSuccess": [
            "This is terrain stalking mastered. Most people need artificial cover to hide - walls, furniture, constructed concealment. Not you. You've trained to see what nature provides. That slight depression in the earth? Concealment. That cluster of grass and shrubs? Perfect camouflage. Those rocks creating subtle shadows? Cover. You position yourself within the natural terrain with absolute precision, using every environmental feature to break up your silhouette and blend with the landscape. Your body settles into the contours of the earth. Natural vegetation partially obscures you. Rock shadows fall across you. Within moments, you've transformed from human figure to natural feature. To any observer, you've simply vanished into the terrain itself. No artificial cover needed - nature provides everything!",
            "Like a wild animal using natural camouflage, you demonstrate perfect environmental integration. You read the terrain with expert eyes, seeing concealment opportunities invisible to others. You don't just hide behind nature - you become part of it. Your positioning exploits every terrain feature: vegetation patterns, ground contours, natural shadows, rock formations. You settle into the landscape with such perfect placement that you're indistinguishable from the environment. Observers could look directly at your location and see nothing but natural terrain. You've achieved perfect concealment through mastery of the natural world!"
          ],
          "success": [
            "You successfully employ terrain stalker techniques to hide using natural features. Where others would need constructed cover, you find concealment in the environment itself. You blend with vegetation, use terrain contours, position within natural shadows. It's functional natural concealment.",
            "Your terrain stalker training allows you to hide using only the natural environment. You exploit terrain features others wouldn't notice, using them to conceal yourself adequately despite the lack of artificial cover."
          ],
          "failure": [
            "You search the natural terrain for concealment opportunities, but this environment defeats even your trained eyes. It's too flat, too barren, too exposed. Your terrain stalker skills are considerable, but they can't create hiding places where none exist. You remain visible, unable to blend with insufficient natural features.",
            "Despite your expertise in natural concealment, the terrain simply doesn't cooperate. You look for the usual opportunities - depressions, vegetation, rocks, shadows - but find nothing adequate. Even terrain stalker mastery has limits. You can't hide effectively in this environment."
          ],
          "criticalFailure": [
            "Your terrain stalker attempt becomes a disaster. You move to position yourself within natural concealment, but everything goes wrong. Maybe you step on dry brush that cracks loudly. Maybe you disturb vegetation that sways obviously. Maybe you dislodge rocks that tumble noisily. Whatever the specific failure, the result is catastrophic. Instead of blending invisibly with nature, you've created obvious disturbance in the environment. Every observer's attention is drawn to the commotion. Your exact position is highlighted by the very terrain you tried to use for concealment. You might as well have shouted your location!",
            "Disaster strikes spectacularly. You attempt to hide within the natural terrain, but your movements create chaos in the environment. Rustling leaves, swaying grass, disturbed earth, scattered small stones - the terrain broadcasts your presence like a beacon. Far from concealing you, nature is now actively revealing your exact location through the disturbances you've created. Your terrain stalker skills have catastrophically backfired. Everyone knows precisely where you are!"
          ]
        }
      }
    }
  }
}
