{
  "action": "shove",
  "actionName": "Shove",
  "skill": "athletics",
  "traits": ["attack"],
  "description": "You push a foe away from you",

  "variants": {
    "default": {
      "displayName": "Shove",
      "narratives": {
        "minimal": {
          "criticalSuccess": [
            "You send {targetName} flying!",
            "You shove {targetName} backward hard!",
            "{targetName} stumbles back far!",
            "You push {targetName} away forcefully!",
            "You drive {targetName} backward!"
          ],
          "success": [
            "You push {targetName} back.",
            "You shove {targetName} away.",
            "{targetName} stumbles backward.",
            "You drive {targetName} back.",
            "You force {targetName} away."
          ],
          "failure": [
            "{targetName} holds their ground.",
            "You can't budge them.",
            "{targetName} resists the push.",
            "They don't move.",
            "Your shove fails."
          ],
          "criticalFailure": [
            "You overextend!",
            "You lose your balance!",
            "{targetName} counters!",
            "You stumble forward!",
            "It backfires!"
          ]
        },

        "standard": {
          "criticalSuccess": [
            "You slam both hands into {targetName} with explosive force, sending them flying backward!",
            "Your powerful shove drives {targetName} back several feet - they nearly fall!",
            "With overwhelming strength, you push {targetName} far out of reach!",
            "You barrel into {targetName}, sending them stumbling backward helplessly!",
            "Your shove is devastating - {targetName} staggers back, arms windmilling!",
            "You drive {targetName} backward with such force they can barely keep their feet!",
            "{targetName} flies backward from the impact of your powerful shove!",
            "You send {targetName} reeling away from you with brutal force!",
            "Your push sends {targetName} stumbling back, completely off-balance!",
            "With explosive power, you drive {targetName} far backward!"
          ],
          "success": [
            "You successfully push {targetName} backward, creating distance.",
            "Your shove forces {targetName} back a few feet.",
            "You manage to drive {targetName} away from you.",
            "{targetName} stumbles backward from your push.",
            "Your shove works - {targetName} is pushed back.",
            "You force {targetName} to give ground.",
            "{targetName} retreats a step from your shove.",
            "You successfully create space between you and {targetName}.",
            "Your push moves {targetName} backward.",
            "You manage to shove {targetName} away."
          ],
          "failure": [
            "You push against {targetName}, but they hold their ground firmly.",
            "Your shove doesn't budge {targetName} at all.",
            "{targetName} plants their feet and resists your push completely.",
            "You can't move {targetName} - they're too solid.",
            "Your attempt to shove {targetName} fails to move them.",
            "{targetName} stands firm against your push.",
            "You push, but {targetName} doesn't give an inch.",
            "Your shove lacks the force to move {targetName}.",
            "{targetName} easily withstands your push.",
            "You can't force {targetName} backward."
          ],
          "criticalFailure": [
            "You overcommit to the shove and stumble forward awkwardly!",
            "Your poorly executed push leaves you off-balance!",
            "{targetName} sidesteps and you nearly fall!",
            "You miss completely and lurch forward!",
            "Your shove backfires - you're the one who's off-balance!",
            "{targetName} braces perfectly and you stumble past them!",
            "You push too hard and lose your footing!",
            "Your failed shove leaves you vulnerable!",
            "{targetName} easily avoids you and you overextend!",
            "You stumble forward when {targetName} doesn't budge!"
          ]
        },

        "detailed": {
          "criticalSuccess": [
            "You plant your feet and drive forward with explosive power, slamming both palms into {targetName}'s chest. The impact is devastating - they fly backward several feet, arms windmilling desperately as they struggle to stay upright. They barely manage to keep from falling, but they're now far out of position!",
            "With perfect technique and overwhelming strength, you barrel into {targetName}. Your shoulder hits them square in the torso and they're launched backward like they were hit by a charging bull. They stumble back multiple steps, totally disrupted!",
            "You execute a powerful two-handed shove that catches {targetName} completely unprepared. The force sends them reeling backward, feet scrambling to keep up with their momentum. By the time they regain balance, you've created significant distance!"
          ],
          "success": [
            "You push hard against {targetName}, managing to force them back a few feet. They resist, but your strength prevails and they give ground reluctantly.",
            "Your shove connects solidly with {targetName}. They stumble backward a step or two, enough to create the space you needed.",
            "You successfully drive {targetName} backward with a firm push. It's not spectacular, but it works - they're now at a distance."
          ],
          "failure": [
            "You push against {targetName} with all your strength, but they've planted their feet well. Despite your effort, they don't budge an inch.",
            "Your shove meets solid resistance. {targetName} braces against your push and holds their ground completely.",
            "You try to force {targetName} backward, but they're simply too solid. Your push accomplishes nothing."
          ],
          "criticalFailure": [
            "You commit fully to shoving {targetName}, but they read it perfectly and sidestep. Your momentum carries you forward, stumbling, nearly falling. You end up more off-balance than they are!",
            "Your overeager shove is poorly timed and executed. {targetName} braces at just the right moment, and when they don't move, you stumble forward awkwardly, completely exposed!",
            "You push with too much force and not enough control. {targetName} simply isn't where you thought they'd be, and you lurch forward, arms extended, barely keeping your feet!"
          ]
        },

        "cinematic": {
          "criticalSuccess": [
            "You explode forward with devastating power, every muscle in your body contributing to the shove. Your hands slam into {targetName} like battering rams, and the laws of physics take over. They're not just pushed - they're launched. Their feet leave the ground for a split second as they fly backward, then they crash down several feet away, stumbling desperately to stay upright. The sheer force of your push has completely disrupted their position and balance. They're reeling, disoriented, utterly dominated by your raw power!",
            "With the precision of a master wrestler and the force of a charging bull, you drive into {targetName}. It's not just a push - it's controlled violence. Your shoulder connects with perfect placement, your legs drive with explosive power, and {targetName} has no choice but to yield. They fly backward, arms flailing, feet scrambling for purchase on ground that seems to slip away beneath them. By the time they regain any semblance of control, you've created a gulf between you!"
          ],
          "success": [
            "You plant your feet and shove hard against {targetName}. They resist, digging in, but your strength is greater. Step by reluctant step, you drive them backward until you've created the distance you need. It's not pretty, but it's effective.",
            "Your push connects solidly with {targetName}. The force isn't overwhelming, but it's enough. They stumble back a few feet, off-balance for a moment, giving you the tactical advantage."
          ],
          "failure": [
            "You push against {targetName} with determined strength, but they've anticipated it. Their stance is perfect, their center of gravity low and stable. Despite your best effort, they don't move. Your hands press against them, muscles straining, but you might as well be pushing a wall.",
            "Your shove meets immovable resistance. {targetName} has planted themselves so solidly that your push accomplishes nothing except demonstrating their superior positioning. Frustrating."
          ],
          "criticalFailure": [
            "In your aggressive attempt to shove {targetName}, you telegraph your intention so obviously that they're ready for it. As you commit to the push, they simply step aside with casual ease. Your momentum, with nothing to stop it, carries you stumbling forward. You have to scramble to regain your footing, and in that moment of vulnerability, you're completely exposed to counterattack!",
            "You throw yourself into the shove with reckless abandon, all power and no technique. {targetName} reads it like a book. They brace at the perfect moment, and when your push connects with their immovable stance, it's you who stumbles. The impact of hitting their solid resistance throws you off-balance. You reel backward, arms pinwheeling, looking foolish while they stand firm and untroubled!"
          ]
        }
      }
    },

    "titan-wrestler": {
      "displayName": "Shove (Titan Wrestler)",
      "feats": ["titan-wrestler"],
      "narratives": {
        "minimal": {
          "criticalSuccess": [
            "You shove the giant back with leverage!",
            "Perfect positioning moves them!",
            "You push the larger foe backward!",
            "Technique overcomes their mass!",
            "The giant stumbles back!"
          ],
          "success": [
            "You push back the larger foe.",
            "Leverage moves them backward.",
            "You shove the giant.",
            "Technique beats size.",
            "You drive them back."
          ],
          "failure": [
            "Their mass resists you.",
            "You can't budge their bulk.",
            "They're too large to move.",
            "Their size defeats your push.",
            "They don't budge."
          ],
          "criticalFailure": [
            "Their mass overwhelms you!",
            "You bounce off them!",
            "Their bulk dominates!",
            "You're thrown back!",
            "Their size crushes your attempt!"
          ]
        },

        "standard": {
          "criticalSuccess": [
            "You use perfect leverage to drive the larger foe backward!",
            "Your technique exploits their high center of gravity - they stumble back!",
            "Despite their size, your positioning sends them reeling backward!",
            "You push the giant back using expert leverage!",
            "Your clever technique overcomes their mass - they fly backward!",
            "You drive the larger foe back with skillful positioning!",
            "Your leverage-based shove sends them stumbling!",
            "You exploit their balance perfectly - they stagger back!",
            "Your expert push overcomes the size difference!",
            "You send the giant reeling with masterful technique!"
          ],
          "success": [
            "You use clever positioning to push the larger foe back.",
            "Your leverage works - they stumble backward.",
            "You manage to shove the bigger opponent away.",
            "Your technique overcomes the size difference.",
            "You push them back using leverage instead of strength.",
            "Your skillful shove moves the larger foe.",
            "You drive them back with expert positioning.",
            "Your leverage creates distance from the giant.",
            "You successfully push back the larger opponent.",
            "Your technique forces them to give ground."
          ],
          "failure": [
            "Their size makes them immovable despite your technique.",
            "You can't generate enough leverage to budge their mass.",
            "The size difference defeats your positioning.",
            "Their bulk resists your skillful push.",
            "You can't overcome their mass.",
            "Their size advantage keeps them planted.",
            "Your leverage isn't enough against their bulk.",
            "They're too large for your technique to move.",
            "Their mass defeats your push.",
            "You can't budge the larger foe."
          ],
          "criticalFailure": [
            "You try to push them but bounce off their mass!",
            "Their bulk doesn't budge and you stumble!",
            "You're overpowered by their sheer size!",
            "Their mass throws you back!",
            "You overextend against their immovable bulk!",
            "Their size dominates - you're off-balance!",
            "You can't move them and stumble!",
            "Their mass crushes your technique!",
            "You bounce off and nearly fall!",
            "Their size defeats you completely!"
          ]
        },

        "detailed": {
          "criticalSuccess": [
            "You don't try to match strength against strength - that would be futile. Instead, you target their balance. You dart in low, positioning yourself at their center of mass. Your push isn't just forward force - it's angled precisely to exploit their high center of gravity. With expert technique, you drive upward and forward. Their size becomes their enemy. They can't help but stumble backward, their mass making the momentum impossible to stop!",
            "Like a master judoka throwing a giant, you use physics instead of strength. You position yourself perfectly, finding the angle where even small force creates large effect. Your shove targets their balance point with surgical precision. Despite their size advantage, they stumble backward, unable to resist your perfectly applied leverage!",
            "You read their stance and exploit the weakness inherent in their size. Your hands find the perfect position, your legs drive at the right angle. It's not about raw power - it's about leverage and timing. You push at exactly the moment they shift their weight, and their own mass betrays them. They reel backward, completely unable to stop the momentum!"
          ],
          "success": [
            "You employ skillful technique to push the larger foe. Using leverage and precise positioning instead of matching their strength, you manage to drive them backward. It takes expert application of force, but you succeed in moving them despite the size difference.",
            "Your shove targets their center of gravity with clever positioning. The size disadvantage makes it challenging, but your technique is sound enough. You manage to force them back, proving leverage can overcome mass.",
            "You use physics-based pushing to move the bigger opponent. By exploiting their balance and applying force at the right angle, you successfully shove them backward."
          ],
          "failure": [
            "You attempt to push the larger foe using proper leverage technique, but their sheer mass defeats your effort. You find the right angle, position correctly, but they're simply too large and too solid. Their size advantage proves insurmountable.",
            "Despite clever positioning and good leverage application, you can't overcome the size difference. The larger foe's bulk keeps them planted. Your shove, technically sound, simply lacks the force needed against their mass.",
            "You try to use their balance against them, but physics doesn't cooperate today. Their size is too great, their stance too stable. Your skilled shove attempt fails to move them."
          ],
          "criticalFailure": [
            "You move in for a leverage-based shove, but their mass is far greater than you anticipated. When you push, it's like trying to move a boulder. Not only don't they budge, but the resistance throws you off balance. You stumble backward, your technique completely overwhelmed by their bulk!",
            "Your technical approach to shoving the larger foe backfires catastrophically. You position yourself to exploit their center of gravity, but you've miscalculated badly. When you push, their immovable mass simply absorbs the force. The impact jars you, throwing you off-balance while they don't even rock!",
            "You attempt to use clever leverage to push the giant, but their size defeats you utterly. Your shove connects perfectly, but they don't even sway. The failed attempt leaves you overextended and vulnerable, your technique crushed by simple physics!"
          ]
        },

        "cinematic": {
          "criticalSuccess": [
            "This is the art of using size against itself. You study the larger foe with calculating precision, seeing not intimidating bulk but exploitable physics. They're tall - high center of gravity. They're massive - lots of momentum once moving. You position yourself with absolute precision, hands finding the exact placement that maximizes leverage. Then you explode upward and forward, pushing not just with arms but with legs, core, your entire body working in biomechanical harmony. The force is perfectly angled, timed to the microsecond of their weight shift. For one suspended moment, the giant teeters. Then physics takes over with merciless authority. Their own mass becomes the weapon. They stumble backward, feet scrambling desperately, arms windmilling for balance they can't find. They reel back several feet before regaining control. You've moved a giant through pure technique!",
            "Like a legendary martial artist demonstrating the triumph of skill over size, you execute the perfect shove. You don't try to overpower them - that's impossible. Instead, you use leverage as your ally. You dart in close, under their reach, and position yourself at their center of mass. Your hands find purchase at exactly the right points. Then you drive forward with explosive precision, every ounce of force applied at the perfect angle to exploit their high center of gravity. The combination is inescapable. Their size, which should be an advantage, instead magnifies the effect. They lurch backward, unable to stop the momentum your technique has created. By the time they regain their balance, you've created significant distance. Proof positive that in combat, physics beats mass!"
          ],
          "success": [
            "You employ solid technique to push the larger opponent. Moving with careful precision and proper body mechanics, you manage to generate enough leverage to move them. It's not easy - their mass resists every inch - but your skill prevails. They stumble backward, forced to yield ground to your superior technique.",
            "Your shove uses proper positioning and leverage to overcome the size disadvantage. You target their balance point at the right moment, applying force where it matters most. The larger foe stumbles back despite their mass, moved by technique rather than brute strength."
          ],
          "failure": [
            "You move in with sound technique, seeking the leverage point that should let you push the larger foe. But today, size simply triumphs over skill. Their mass is too great, their stance too stable. Despite textbook-perfect positioning and proper force application, they don't budge. You might as well be pushing a wall. Your shove has failed.",
            "Your technical approach is flawless - positioning, angle, timing all correct. But reality proves unkind. The larger foe's sheer bulk creates challenges your skill simply can't overcome. You can't generate enough effective force to move their mass. They remain planted while your pushing accomplishes nothing."
          ],
          "criticalFailure": [
            "You commit to the shove with complete confidence in your technique. You've studied leverage, practiced positioning, and you're certain you can move this larger foe. You're catastrophically wrong. You set yourself, find what you think is the perfect angle, and push with explosive force. And achieve... nothing. The larger foe doesn't just resist - they might as well be a stone pillar for all the effect your shove has. Worse, pushing against their immovable bulk throws you off balance. The jarring stop of your momentum sends you stumbling backward, arms flailing. What should have been them moving is instead you looking foolish and exposed. Size has defeated skill decisively!",
            "Your attempt to shove the giant using leverage and technique becomes a masterclass in failure. You position yourself with what you believe is perfect precision, ready to exploit their balance. But when you execute the shove, reality intervenes brutally. Their mass is simply too overwhelming. Your push doesn't just fail - it rebounds. The force of hitting their immovable bulk throws you backward. You stumble, overextended and off-balance, while they stand there completely unaffected, perhaps not even aware you tried to move them. Your expertise has been utterly overwhelmed by simple physics!"
          ]
        }
      }
    }
  }
}
