{
  "action": "sneak",
  "actionName": "Sneak",
  "skill": "stealth",
  "traits": ["move", "secret"],
  "description": "You move while attempting to remain hidden or undetected",

  "variants": {
    "default": {
      "displayName": "Sneak",
      "narratives": {
        "minimal": {
          "criticalSuccess": [
            "You move silently!",
            "Perfect stealth!",
            "You slip past undetected!",
            "You move like a ghost!",
            "Completely silent movement!"
          ],
          "success": [
            "You sneak successfully.",
            "You move quietly.",
            "You remain undetected.",
            "You slip by quietly.",
            "You move stealthily."
          ],
          "failure": [
            "You make noise.",
            "You're detected.",
            "Your stealth fails.",
            "You're noticed.",
            "You can't move quietly enough."
          ],
          "criticalFailure": [
            "You make loud noise!",
            "You're spotted immediately!",
            "You stumble loudly!",
            "You alert everyone!",
            "You crash into something!"
          ]
        },

        "standard": {
          "criticalSuccess": [
            "You move with perfect silence - completely undetected!",
            "You slip past like a ghost, making absolutely no noise!",
            "Your stealthy movement is flawless - no one notices you!",
            "You move with expert stealth, remaining completely hidden!",
            "You glide forward silently, perfectly undetected!",
            "Your movement is soundless and invisible to observers!",
            "You sneak with such skill you might as well be invisible!",
            "You move past with perfect stealth - unheard and unseen!",
            "Your silent movement is masterful - you're completely undetected!",
            "You slip forward with expert stealth, remaining perfectly hidden!"
          ],
          "success": [
            "You move quietly enough to remain undetected.",
            "You successfully sneak forward without being noticed.",
            "You manage to move stealthily without alerting anyone.",
            "You slip forward quietly, maintaining your concealment.",
            "You move carefully and remain hidden.",
            "You successfully sneak without being detected.",
            "You move forward quietly enough to stay unnoticed.",
            "You manage to advance stealthily.",
            "You move while maintaining stealth successfully.",
            "You sneak forward without being spotted."
          ],
          "failure": [
            "You make noise while moving and are detected!",
            "Your stealthy movement fails - you're noticed!",
            "You can't move quietly enough - you're spotted!",
            "Your sneaking fails and you're detected!",
            "You're noticed while trying to move stealthily!",
            "You alert observers with your movement!",
            "Your attempt at stealthy movement is unsuccessful!",
            "You make too much noise - you're detected!",
            "You fail to move quietly and are noticed!",
            "Your stealth breaks - you're spotted!"
          ],
          "criticalFailure": [
            "You stumble badly and make loud noise - everyone notices you!",
            "You crash into something while sneaking - your position is revealed!",
            "Your clumsy movement alerts everyone to your presence!",
            "You knock something over loudly - you're immediately spotted!",
            "You trip while sneaking and draw all attention to yourself!",
            "Your failed stealth creates a loud disturbance!",
            "You make a tremendous noise - everyone knows exactly where you are!",
            "You stumble into something and alert everyone nearby!",
            "Your catastrophically failed sneak gives away your position!",
            "You make such loud noise that everyone is alerted to you!"
          ]
        },

        "detailed": {
          "criticalSuccess": [
            "You move with the silence of falling snow. Each footstep is carefully placed, testing surfaces before committing weight. You control your breathing, time your movements to ambient noise, and flow from concealment to concealment. Your stealthy advance is perfect - you could walk right past someone and they'd never know you were there!",
            "Your stealth technique is masterful. You read the environment perfectly, knowing where to step, when to move, how to time each advancement. Your movements are fluid and silent, your positioning always optimal. You glide forward like a shadow, completely undetected!",
            "You demonstrate expert stealth skills as you move forward. Every step is silent, every movement controlled. You blend with your surroundings and time your advancement perfectly. You remain completely undetected as you progress!"
          ],
          "success": [
            "You move forward carefully, placing each step with conscious thought. You're not perfectly silent, but you're quiet enough to avoid detection. Your stealthy movement succeeds in keeping you hidden.",
            "You manage to advance while maintaining adequate stealth. Your footfalls are soft, your movements controlled. You make it forward without being noticed.",
            "You successfully sneak forward. Your technique is functional, your noise discipline adequate. You remain undetected as you move."
          ],
          "failure": [
            "Despite your best efforts to move stealthily, you make too much noise or your movement is too obvious. You're detected as you try to advance. Your stealth has failed.",
            "You attempt to move quietly, but something goes wrong - maybe a footfall is too heavy, maybe you brush against something. Whatever the cause, you're noticed. Your sneaking has failed.",
            "Your stealthy movement isn't quiet or subtle enough. You're spotted or heard as you try to advance. You've been detected."
          ],
          "criticalFailure": [
            "Your attempted stealth movement goes disastrously wrong. Maybe you step on something that makes a loud crack, maybe you lose your footing and stumble, or maybe you knock into something you didn't see. Whatever happens, the result is unmistakable noise and obvious movement. Everyone in the area knows exactly where you are!",
            "Catastrophe strikes your sneaking attempt. Your foot finds the one creaky board, or the loose stone, or the hidden debris. The noise is loud and clear. Or perhaps you simply stumble and fall, making a tremendous crash. Whatever the specific failure, the result is the same - you're not just detected, you're the center of everyone's attention!",
            "Your stealth fails in the worst possible way. Instead of silent movement, you create a disturbance that alerts everyone nearby. Your position is not only revealed but emphasized. It's a complete failure of stealth!"
          ]
        },

        "cinematic": {
          "criticalSuccess": [
            "You become one with the shadows as you move. Each footfall is placed with microscopic precision, your weight distributed perfectly to eliminate sound. You read the environment like a book - that floorboard creaks, that patch of gravel would crunch, that shadow provides perfect concealment for the next three steps. You flow through space like water finding its path, silent and inevitable. Your breathing is controlled to near-silence, your movements timed to ambient noise, your positioning always optimal. You're not just moving stealthily - you're moving invisibly. You could walk within arm's reach of an alert guard and they'd never know you passed. This is stealth perfected!",
            "Like a phantom, you drift forward through the environment. Your understanding of stealth is intuitive and complete. You know instinctively where to step, how to move, when to advance and when to freeze. Your footfalls are whisper-quiet, your silhouette blends with surroundings, your timing is impeccable. You navigate the space with absolute confidence, knowing that your stealth skills are more than equal to the challenge. You advance with perfect silence, a ghost moving through a world of the living, completely undetected!"
          ],
          "success": [
            "You move forward with careful stealth. Each step is consciously controlled, each movement deliberate. You're not perfectly silent - true soundless movement is incredibly difficult - but you're quiet enough. Your discipline and technique are adequate to avoid detection as you advance.",
            "You successfully employ stealth techniques to move forward undetected. Careful footwork, controlled breathing, smart use of concealment - the fundamentals of sneaking executed competently. You make it forward without being noticed."
          ],
          "failure": [
            "Despite your best efforts at stealth, you're detected. Maybe a footfall is too heavy, maybe your timing is off, maybe you're just unlucky. Whatever the specific cause, the result is clear - someone notices you. Your stealth has failed and you've been spotted.",
            "Your attempted stealth movement breaks down. You're trying to move quietly, consciously controlling each step, but something goes wrong. A sound, a movement, a silhouette - something gives you away. You're detected, your stealth compromised."
          ],
          "criticalFailure": [
            "Disaster. You're moving carefully, every sense focused on remaining undetected, when catastrophe strikes. Maybe your foot comes down on something unexpected - a stick that snaps with a sound like a gunshot, a loose stone that clatters loudly. Maybe you misjudge a distance and bump into something, sending it crashing. Maybe you simply lose your footing and stumble loudly. Whatever the specific failure, the result is unmistakable and irreversible. Loud noise echoes through the area. Obvious movement draws every eye. You're not just detected - you're announced. Everyone in the vicinity knows exactly where you are. Your stealth hasn't just failed, it's transformed into its opposite - a beacon highlighting your precise location!",
            "Your sneaking attempt becomes a spectacular failure. You're trying so hard to move quietly that you're not paying enough attention to your surroundings. Your foot catches on something you didn't see, or you step on something you didn't anticipate. The result is catastrophic - a loud crash, obvious stumbling, clear evidence of your presence. You might as well have announced yourself with a trumpet fanfare. Every observer, every guard, every potential threat now knows exactly where you are. Your failed stealth has actually made you more noticeable than if you'd just walked normally!"
          ]
        }
      }
    }
  }
}
