{
  "action": "swim",
  "actionName": "Swim",
  "skill": "athletics",
  "traits": ["move"],
  "description": "You propel yourself through water",

  "variants": {
    "default": {
      "displayName": "Swim",
      "narratives": {
        "minimal": {
          "criticalSuccess": [
            "You glide through the water!",
            "You swim powerfully forward!",
            "You cut through the waves!",
            "You move swiftly through the water!",
            "You swim with ease!"
          ],
          "success": [
            "You swim steadily forward.",
            "You make progress through the water.",
            "You propel yourself ahead.",
            "You swim successfully.",
            "You move through the water."
          ],
          "failure": [
            "You barely stay afloat.",
            "You make no forward progress.",
            "The water defeats you.",
            "You can't move ahead.",
            "You struggle to swim."
          ],
          "criticalFailure": [
            "You start to sink!",
            "You go under!",
            "You're drowning!",
            "You can't stay up!",
            "The water overwhelms you!"
          ]
        },

        "standard": {
          "criticalSuccess": [
            "You cut through the water with powerful strokes, swimming swiftly!",
            "Your technique is excellent - you glide forward with impressive speed!",
            "You swim with practiced efficiency, making rapid progress!",
            "Your powerful movements propel you through the water beautifully!",
            "You slice through the waves like a natural swimmer!",
            "Your swimming is smooth and fast - you're barely slowed by the water!",
            "You move through the water with the grace of a fish!",
            "Your strokes are strong and sure - you swim excellently!",
            "You power forward through the water with athletic prowess!",
            "You swim with impressive skill and speed!"
          ],
          "success": [
            "You manage to swim forward, making steady progress.",
            "Your strokes carry you through the water adequately.",
            "You successfully propel yourself ahead, though it takes effort.",
            "You swim competently, moving forward at a reasonable pace.",
            "You make your way through the water with determination.",
            "Your swimming gets you where you need to go.",
            "You push through the water successfully.",
            "You manage to keep swimming forward despite the challenge.",
            "Your technique is solid enough to make progress.",
            "You swim steadily, if not spectacularly."
          ],
          "failure": [
            "You struggle in the water, barely managing to stay afloat.",
            "Your swimming is ineffective - you make no forward progress.",
            "You flounder in the water, unable to propel yourself ahead.",
            "The water seems to fight you - you can't make headway.",
            "Your strokes are weak and ineffective - you stay in place.",
            "You struggle just to keep your head above water.",
            "You can't seem to get any traction against the water.",
            "Your swimming fails to move you forward.",
            "You thrash in the water without making progress.",
            "You're working hard but going nowhere."
          ],
          "criticalFailure": [
            "Your swimming fails completely - you start to sink!",
            "You go under, water closing over your head!",
            "Your technique fails and you begin to drown!",
            "You can't keep your head up - you're sinking!",
            "Panic sets in as you slip beneath the surface!",
            "Your strength gives out and you go under!",
            "You choke on water as you sink!",
            "You're overwhelmed by the water - drowning!",
            "Your arms and legs won't respond - you're sinking!",
            "Water floods your lungs as you slip under!"
          ]
        },

        "detailed": {
          "criticalSuccess": [
            "Your body moves through the water with practiced efficiency. Each stroke is powerful and precise, your breathing perfectly timed. Your legs kick with strong rhythm while your arms pull through the water, propelling you forward at impressive speed. You swim like someone born to the water!",
            "You attack the water with athletic grace. Your streamlined form cuts through the waves with minimal resistance, and your powerful strokes eat up the distance. This is swimming at its finest - strong, smooth, and swift!",
            "With each pull of your arms, you surge forward through the water. Your technique is superb, wasting no energy on unnecessary movement. You glide through the water like a predator, fast and confident!"
          ],
          "success": [
            "You swim with solid technique, arms and legs working together to push you through the water. It's not effortless, but you're making good forward progress with each stroke.",
            "You propel yourself through the water with determined effort. Your swimming is functional and effective, if not spectacular. You're covering distance steadily.",
            "Your strokes carry you forward adequately. The water provides resistance, but you have the strength and skill to overcome it. You're swimming successfully."
          ],
          "failure": [
            "Despite your best efforts, you can't seem to make any forward progress. You're treading water effectively enough, but your attempts to swim ahead are fruitless. The water seems to resist every stroke.",
            "You struggle against the water, arms and legs churning, but you're essentially staying in one place. Your technique isn't working, and you're expending energy without gaining ground.",
            "Try as you might, you can't get your swimming to work. You stay afloat, but forward movement eludes you completely. The water has won this round."
          ],
          "criticalFailure": [
            "Your arms suddenly feel like lead. Your legs stop responding properly. Panic flashes through you as you realize you're no longer staying up - you're going down. Water closes over your head as you sink beneath the surface, lungs burning!",
            "Your technique fails catastrophically. One moment you're trying to swim, the next your head is under water. You thrash desperately, but you can't seem to get back to the surface. You're drowning!",
            "Exhaustion or fear takes over, and your swimming simply stops working. Your body sinks like a stone. Water floods into your mouth and nose as you slip under, the surface retreating above you!"
          ]
        },

        "cinematic": {
          "criticalSuccess": [
            "You become one with the water, your body transformed into a vessel of pure aquatic efficiency. Each stroke is poetry in motion - arms slicing through the surface with barely a splash, legs driving you forward with metronomic precision. Your breathing is perfectly controlled, never breaking your rhythm. You don't fight the water - you use it, working with the current, reading the waves, finding the path of least resistance. The distance melts away beneath your mastery. You swim with the confidence and skill of someone for whom water is a second home!",
            "Power and technique combine into swimming excellence. Your shoulders roll with each stroke, muscles flexing in perfect sequence to drive maximum force through the water. Your streamlined form cuts through the waves like a knife, leaving barely a ripple in your wake. This is athletic performance at its peak - beautiful, efficient, and devastatingly effective!"
          ],
          "success": [
            "You swim with workmanlike efficiency, arms and legs moving in steady rhythm. It's not flashy, but it works. Stroke after stroke, you propel yourself forward, slowly but surely covering the distance you need to travel.",
            "Your swimming is competent and determined. The water provides resistance, but you have the strength to overcome it. You move forward at a steady, sustainable pace."
          ],
          "failure": [
            "The water seems to actively resist your efforts. Every stroke feels like you're pulling against syrup. Your legs kick with decreasing effectiveness. Despite burning effort and technical knowledge, you simply cannot make forward progress. You stay afloat, treading water, but movement eludes you.",
            "Your swimming degrades into floundering. Arms and legs churn the water frantically, expending tremendous energy but accomplishing nothing. You're not sinking, but you're also not going anywhere. It's exhausting and futile."
          ],
          "criticalFailure": [
            "In one terrible moment, everything goes wrong. Maybe it's a wave you didn't see, maybe it's sudden exhaustion, maybe it's panic - but the result is the same. Your swimming fails completely. Your head goes under water before you can draw breath. You try to fight your way back to the surface, but your limbs won't cooperate. Water floods your mouth as you sink. The surface gets farther away. Your lungs scream for air. Bubbles stream upward as you plunge downward. This is drowning, and it's happening now!",
            "Your technique collapses catastrophically. One second you're swimming, the next you're sinking. Your arms thrash uselessly. Your legs cramp or simply stop working. Panic overrides training. You go under, the water closing over your head like a grave. You struggle desperately toward what you think is up, but you're disoriented, lungs burning, terror rising. The water has claimed you!"
          ]
        }
      }
    }
  }
}
